taylorCouette/system/blockMeshDict_noSecondaryFlowStructures
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.020175 -0.020175 -0.0080076)
    (0.020175 -0.020175 -0.0080076)
    (0.020175 0.020175 -0.0080076)
    (-0.020175 0.020175 -0.0080076)
    (-0.020175 -0.020175 0.0080076)
    (0.020175 -0.020175 0.0080076)
    (0.020175 0.020175 0.0080076)
    (-0.020175 0.020175 0.0080076)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 16) simpleGrading (1 1 1)

);  

edges
();

boundary
(
    wmx
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    wpx
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    wpz
    {
        type wall;
        faces
        (
            (5 6 7 4)
        );
    }
    wmz
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    wmy
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    wpy
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
