taylorCouette/system/surfaceFeatureExtractDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.2                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bottom.stl {extractionMethod extractFromSurface; extractFromSurfaceCoeffs {includedAngle 120;} writeObj yes;} 
inner_wall.stl {extractionMethod extractFromSurface; extractFromSurfaceCoeffs {includedAngle 120;} writeObj yes;} 
outer_wall.stl {extractionMethod extractFromSurface; extractFromSurfaceCoeffs {includedAngle 120;} writeObj yes;} 
top.stl {extractionMethod extractFromSurface; extractFromSurfaceCoeffs {includedAngle 120;} writeObj yes;} 
